tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Python code formatter
brew "black"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Experimental optional static type checker for Python
brew "mypy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@16", link: true
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# API documentation browser and code snippet manager
cask "dash"
# Utility to show apps badges from the dock in the menu bar
cask "doll"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Web browser
cask "librewolf"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Menu bar customization tool
cask "swiftbar"
# Real time file synchronization software
cask "syncthing"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Wine wrapper built with SwiftUI
cask "whisky"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
