tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "tmzane/tap"
brew "bat"                     # Clone of cat(1) with syntax highlighting and Git integration (https://github.com/sharkdp/bat)
brew "sqlite"                  # Command-line interface for SQLite (https://sqlite.org/index.html)
brew "black"                   # Python code formatter (https://black.readthedocs.io/en/stable)
brew "duti"                    # Select default apps for documents and URL schemes on macOS (https://github.com/moretension/duti)
brew "fd"                      # Simple, fast and user-friendly alternative to find (https://github.com/sharkdp/fd)
brew "fish"                    # User-friendly command-line shell for UNIX-like operating systems (https://fishshell.com)
brew "fzf"                     # Command-line fuzzy finder written in Go (https://github.com/junegunn/fzf)
brew "gh"                      # GitHub command-line tool (https://github.com/cli/cli)
brew "go"                      # Open source programming language to build simple/reliable/efficient software (https://go.dev)
brew "golangci-lint"           # Fast linters runner for Go (https://golangci-lint.run)
brew "htop"                    # Improved top (interactive process viewer) (https://htop.dev)
brew "jq"                      # Lightweight and flexible command-line JSON processor (https://stedolan.github.io/jq)
brew "mypy"                    # Experimental optional static type checker for Python (http://www.mypy-lang.org)
brew "ruff"                    # Extremely fast Python linter, written in Rust (https://github.com/charliermarsh/ruff)
brew "stow"                    # Organize software neatly under a single directory tree (e.g. /usr/local) (https://www.gnu.org/software/stow)
brew "tldr"                    # Simplified and community-driven man pages (https://tldr.sh)
brew "tree"                    # Display directories as trees (with optional color/HTML output) (http://mama.indstate.edu/users/ice/tree)
brew "wireguard-tools"         # Tools for the WireGuard secure network tunnel (https://www.wireguard.com)
brew "youtube-dl"              # Download YouTube videos from the command-line (https://youtube-dl.org)
brew "zig"                     # Programming language designed for robustness, optimality, and clarity (https://ziglang.org)
brew "tmzane/tap/goversion"    # Easily switch between multiple Go versions (https://github.com/tmzane/goversion)
brew "tmzane/tap/musttag"      # A Go linter that enforces field tags in (un)marshaled structs (https://github.com/tmzane/musttag)
cask "alfred"                  # Application launcher and productivity software (https://www.alfredapp.com)
cask "alt-tab"                 # Enable Windows-like alt-tab (https://alt-tab-macos.netlify.app)
cask "dash"                    # API documentation browser and code snippet manager (https://kapeli.com/dash)
cask "docker"                  # App to build and share containerized applications and microservices (https://www.docker.com/products/docker-desktop)
cask "doll"                    # Utility to show apps badges from the dock in the menu bar (https://github.com/xiaogdgenuine/Doll)
cask "font-fira-code"          # Free monospaced font with programming ligatures (https://github.com/tonsky/FiraCode)
cask "insomnia"                # HTTP and GraphQL Client (https://insomnia.rest)
cask "jetbrains-toolbox"       # JetBrains tools manager (https://www.jetbrains.com/toolbox-app)
cask "librewolf"               # Web browser (https://librewolf.net)
cask "lulu"                    # Open-source firewall to block unknown outgoing connections (https://objective-see.com/products/lulu.html)
cask "netnewswire"             # Free and open-source RSS reader (https://netnewswire.com)
cask "obsidian"                # Knowledge base that works on top of a local folder of plain text Markdown files (https://obsidian.md)
cask "protonmail-bridge"       # Bridges Proton Mail to email clients supporting IMAP and SMTP protocols (https://proton.me/mail/bridge)
cask "qlmarkdown"              # QuickLook generator for Markdown files (https://github.com/sbarex/QLMarkdown)
cask "rectangle"               # Move and resize windows using keyboard shortcuts or snap areas (https://rectangleapp.com)
cask "scroll-reverser"         # Tool to reverse the direction of scrolling (https://pilotmoon.com/scrollreverser)
cask "sloth"                   # Displays all open files and sockets in use by all running processes (https://sveinbjorn.org/sloth)
cask "spotify"                 # Music streaming service (https://www.spotify.com)
cask "steam"                   # Video game digital distribution service (https://store.steampowered.com/about)
cask "sublime-text"            # Text editor for code, markup and prose (https://www.sublimetext.com)
cask "swiftbar"                # Menu bar customization tool (https://swiftbar.app)
cask "syncthing"               # Real time file synchronization software (https://syncthing.net)
cask "syntax-highlight"        # Quicklook extension for source files (https://github.com/sbarex/SourceCodeSyntaxHighlight)
cask "telegram"                # Messaging app with a focus on speed and security (https://macos.telegram.org)
cask "tor-browser"             # Web browser focusing on security (https://www.torproject.org)
cask "transmission"            # Open-source BitTorrent client (https://transmissionbt.com)
cask "utm"                     # Virtual machines UI using QEMU (https://getutm.app)
cask "vlc"                     # Multimedia player (https://www.videolan.org/vlc)
cask "wireshark"               # Network protocol analyzer (https://www.wireshark.org)
