tap "homebrew/bundle"
tap "homebrew/services"
tap "karinushka/paneru"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# New way of working with Protocol Buffers
brew "buf"
# Debugger for the Go programming language
brew "delve"
# Diff that understands syntax
brew "difftastic"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Pager program similar to more
brew "less"
# Postgres C API library
brew "libpq", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Open source relational database management system
brew "mysql-client", link: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Create, run, and share large language models (LLMs)
brew "ollama"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Tool for managing OCI containers and pods
brew "podman"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Alternative to docker-compose using podman
brew "podman-compose"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python type checker, written in Rust
brew "ty"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Sliding, tiling window manager for MacOS
brew "karinushka/paneru/paneru"
# Application launcher and productivity software
cask "alfred"
# VPN client
cask "amneziavpn"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Utility to show apps badges from the dock in the menu bar
cask "doll"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Keyboard customiser
cask "karabiner-elements"
# ZSA keyboard firmware flasher
cask "keymapp"
# Web browser
cask "librewolf"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Free and open-source RSS reader
cask "netnewswire"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Real time file synchronisation software
cask "syncthing-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
