tap "charmbracelet/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# New way of working with Protocol Buffers
brew "buf"
# Debugger for the Go programming language
brew "delve"
# Diff that understands syntax
brew "difftastic"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Pager program similar to more
brew "less"
# Postgres C API library
brew "libpq", link: true
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Open source relational database management system
brew "mysql-client", link: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tool for managing OCI containers and pods
brew "podman"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Alternative to docker-compose using podman
brew "podman-compose"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python type checker, written in Rust
brew "ty"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# AI on the command line
brew "charmbracelet/tap/mods"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Utility to show apps badges from the dock in the menu bar
cask "doll"
cask "font-jetbrains-mono-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
